gianbartadougall/WatchDog-ESP32/STM32/Core/Src/watchdog.c
/**
 * @file watchdog.c
 * @author Gian Barta-Dougall ()
 * @brief
 * @version 0.1
 * @date 2023-07-03
 *
 * @copyright Copyright (c) 2023
 *
 */

/* C Library Includes */
#include <stdarg.h>

/* STM32 Library Includes */
#include "usb_device.h"
#include "usbd_cdc_if.h"

/* Personal Includes */
#include "watchdog.h"
#include "event_group.h"
#include "datetime.h"
#include "utils.h"
#include "hardware_config.h"
#include "gpio.h"
#include "task_scheduler.h"
#include "task_scheduler_config.h"
#include "stm32_uart.h"
#include "log_usb.h"
#include "bpacket.h"
#include "comms_stm32.h"
#include "rtc_mcp7940n.h"
#include "watchdog_utils.h"
#include "ds18b20.h"
#include "integer.h"
#include "float.h"
#include "event_timeout_stm.h"

/* Private Enums */

/* Private Macros */
#define WD_FLASH_SETTINGS_START_ADDRESS 0x0803F800
#define WD_FLASH_SETTINGS_END_ADDRESS   0x0803F8BC

/* Public Variables */
event_group_t gbl_EventsStm, gbl_EventsEsp;
et_timeout_t lg_Timeouts;

/* Private Variables */
capture_time_t gbl_CaptureTime;
camera_settings_t lg_CameraSettings;

ds18b20_t Ds18b20 = {
    .rom  = DS18B20_ROM_1,
    .temp = 0,
};

char errorMsg[150];

/* Function Prototypes */
uint8_t usb_read_packet(bpk_t* Bpacket);
uint8_t wd_request_photo_capture(uint8_t errorCode[1]);

uint8_t wd_write_settings(capture_time_t* CaptureTime, camera_settings_t* CameraSettings);
void wd_read_settings(capture_time_t* CaptureTime, camera_settings_t* CameraSettings);

void wd_handle_esp_response(bpk_t* Bpacket);
void wd_handle_maple_request(bpk_t* Bpacket);
void wd_write_bpacket_maple(bpk_t* Bpacket);
void wd_write_bpacket_esp(bpk_t* Bpacket);

void i2c_test(void) {

    if (dt_datetime_init(&gbl_CaptureTime.Start, 0, 0, 6, 5, 7, 2023) != TRUE) {
        wd_error_handler(__FILE__, __LINE__);
    }

    if (dt_datetime_init(&gbl_CaptureTime.End, 0, 0, 6, 31, 12, 2023) != TRUE) {
        wd_error_handler(__FILE__, __LINE__);
    }

    gbl_CaptureTime.intervalSecond = 30;
    gbl_CaptureTime.intervalMinute = 0;
    gbl_CaptureTime.intervalHour   = 0;
    gbl_CaptureTime.intervalDay    = 0;

    if (rtc_init() != TRUE) {
        wd_error_handler(__FILE__, __LINE__);
    }

    if (rtc_write_datetime(&gbl_CaptureTime.Start) != TRUE) {
        wd_error_handler(__FILE__, __LINE__);
    }

    dt_datetime_t Alarm;
    if (dt_datetime_init(&Alarm, 10, 0, 6, 5, 7, 2023) != TRUE) {
        wd_error_handler(__FILE__, __LINE__);
    }

    dt_datetime_t bTime;
    if (rtc_read_datetime(&bTime) != TRUE) {
        wd_error_handler(__FILE__, __LINE__);
    }

    if (rtc_enable_alarm() != TRUE) {
        wd_error_handler(__FILE__, __LINE__);
    }

    if (rtc_set_alarm(&Alarm) != TRUE) {
        wd_error_handler(__FILE__, __LINE__);
    }

    dt_datetime_t aTime;
    if (rtc_read_alarm_datetime(&aTime) != TRUE) {
        wd_error_handler(__FILE__, __LINE__);
    }

    log_usb_success("Alarm set to %i:%i:%i %i/%i/%i\tTime set to %i:%i:%i %i/%i/%i \r\n", aTime.Time.hour,
                    aTime.Time.minute, aTime.Time.second, aTime.Date.day, aTime.Date.month, aTime.Date.year,
                    bTime.Time.hour, bTime.Time.minute, bTime.Time.second, bTime.Date.day, bTime.Date.month,
                    bTime.Date.year);

    dt_datetime_t Datetime;
    uint8_t lastSecond = 0;

    while (1) {

        // if (rtc_read_datetime(&Datetime) != TRUE) {
        //     wd_error_handler(__FILE__, __LINE__);
        // }

        // if (Datetime.Time.second != lastSecond) {
        //     lastSecond = Datetime.Time.second;
        //     log_usb_success("%i:%i:%i %i/%i/%i\r\n", Datetime.Time.hour, Datetime.Time.minute, Datetime.Time.second,
        //                     Datetime.Date.day, Datetime.Date.month, Datetime.Date.year);
        // }

        if (event_group_poll_bit(&gbl_EventsEsp, EVENT_ESP_TAKE_PHOTO, EGT_ACTIVE) == TRUE) {
            event_group_clear_bit(&gbl_EventsEsp, EVENT_ESP_TAKE_PHOTO, EGT_ACTIVE);

            if (rtc_read_datetime(&Datetime) != TRUE) {
                wd_error_handler(__FILE__, __LINE__);
            }

            log_usb_success("Photo Captured! @ %i:%i:%i %i/%i/%i \r\n", Datetime.Time.hour, Datetime.Time.minute,
                            Datetime.Time.second, Datetime.Date.day, Datetime.Date.month, Datetime.Date.year);
        }

        if (event_group_poll_bit(&gbl_EventsStm, EVENT_STM_RTC_UPDATE_ALARM, EGT_ACTIVE) == TRUE) {
            event_group_clear_bit(&gbl_EventsStm, EVENT_STM_RTC_UPDATE_ALARM, EGT_ACTIVE);

            // Read the the current alarm time
            dt_datetime_t AlarmTime;
            if (rtc_read_alarm_datetime(&AlarmTime) != TRUE) {
                wd_error_handler(__FILE__, __LINE__);
            }

            dt_datetime_add_time(&AlarmTime, gbl_CaptureTime.intervalSecond, gbl_CaptureTime.intervalMinute,
                                 gbl_CaptureTime.intervalHour, gbl_CaptureTime.intervalDay);

            if (dt1_greater_than_dt2(&AlarmTime, &gbl_CaptureTime.Start) == TRUE) {
                rtc_disable_alarm();
            } else {
                rtc_set_alarm(&AlarmTime);
            }
        }

        HAL_Delay(10);
    }
}

void wd_handle_timeouts(void) {

    bpk_t BpkStm32Response;

    if (et_timeout_has_occured(&lg_Timeouts, EVENT_ESP_TAKE_PHOTO) == TRUE) {

        if (event_group_poll_bit(&gbl_EventsEsp, EVENT_ESP_TAKE_PHOTO, EGT_STM_REQUEST) == FALSE) {
            bpk_create_sp(&BpkStm32Response, BPK_Addr_Receive_Maple, BPK_Addr_Send_Stm32, BPK_Request_Message,
                          BPK_Code_Success, "ESP Take photo Timed out");
            wd_write_bpacket_maple(&BpkStm32Response);
        } else {
            log_usb_error("ESP Take photo timeout occured!\r\n");
        }

        // Clear all necessary event bits
        et_clear_timeout(&lg_Timeouts, EVENT_ESP_TAKE_PHOTO);
        event_group_clear_bit(&gbl_EventsEsp, EVENT_ESP_TAKE_PHOTO, EGT_ACTIVE);
        event_group_clear_bit(&gbl_EventsEsp, EVENT_ESP_TAKE_PHOTO, EGT_STM_REQUEST);
        event_group_clear_bit(&gbl_EventsEsp, EVENT_ESP_TAKE_PHOTO, EGT_EVENT_RUNNING);
    }
}

void wd_error_handler_2(char* format, ...) {

    static char msg[100];
    va_list args;
    va_start(args, format);
    vsprintf(msg, format, args);
    va_end(args);

    while (1) {
        GPIO_TOGGLE(LED_RED_PORT, LED_RED_PIN);
        log_usb_error(msg);
        HAL_Delay(1000);
    }
}

void wd_error_handler1(char* fileName, uint32_t lineNumber, uint8_t code) {

    while (1) {
        GPIO_TOGGLE(LED_RED_PORT, LED_RED_PIN);
        log_usb_error("Error in %s on line %i. Code: %i\r\n", fileName, lineNumber, code);
        HAL_Delay(1000);
    }
}

void wd_esp_turn_on(void) {
    GPIO_SET_LOW(ESP32_POWER_PORT, ESP32_POWER_PIN);

    // Set the event bit to signify the ESP now has power
    event_group_set_bit(&gbl_EventsEsp, EVENT_ESP_ON, EGT_ACTIVE);

    /* Start timeout for ping */
}

