gianbartadougall/WatchDog-ESP32/STM32/Core/Src/watchdog.c
void wd_esp_turn_off(void) {
    GPIO_SET_HIGH(ESP32_POWER_PORT, ESP32_POWER_PIN);

    // Clear the esp ready and on flags
    event_group_clear_bit(&gbl_EventsEsp, EVENT_ESP_ON, EGT_ACTIVE);
    event_group_clear_bit(&gbl_EventsEsp, EVENT_ESP_READY, EGT_ACTIVE);
}

void wd_start(void) {

    // Initialise all the hardware
    hardware_config_init();

    /* Initialise software */
    uart_init();    // Initialise COMMS with the esp32
    ds18b20_init(); // Initialise the temperature sensor

    // TODO: Change the task scheduler timer. TIM15 is used for the ds18b20 so it cannot
    // be used for the task scheduler. Will need to find a different one. Reenable timer
    // in hardware config.c as I commented it out
    // task_scheduler_init(); // Reset Recipes list

    uint8_t code = rtc_init();
    if (code != TRUE) {
        wd_error_handler1(__FILE__, __LINE__, code);
    }

    // Read the watchdog settings from flash
    wd_read_settings(&gbl_CaptureTime, &lg_CameraSettings);

    // Initialise event groups
    event_group_clear(&gbl_EventsStm);
    event_group_clear(&gbl_EventsEsp);

    // TODO: Confirm the start, end and interval times just read are valid

    // TODO: Calcaulte when the next alarm should be and set the RTC alarm for that

    /* Confirm the settings are valid */
    uint8_t errorFound = FALSE;
    /* TODO: Check the rest of the values */

    if (lg_CameraSettings.frameSize > WD_CR_UXGA_1600x1200) {
        lg_CameraSettings.frameSize = WD_CR_UXGA_1600x1200;
        errorFound                  = TRUE;
    }

    if (lg_CameraSettings.jpegCompression > 63) {
        lg_CameraSettings.jpegCompression = 8;
        errorFound                        = TRUE;
    }

    if (errorFound) {
        wd_write_settings(&gbl_CaptureTime, &lg_CameraSettings);
    }

    // Set flag 'take photo' flag. In main loop below, STM32 will request ESP to
    // take a photo if this flag has been set. Getting ESP32 to take a photo on
    // startup to ensure the system is working correctly
    event_group_set_bit(&gbl_EventsEsp, EVENT_ESP_TAKE_PHOTO, EGT_ACTIVE);
    event_group_set_bit(&gbl_EventsEsp, EVENT_ESP_TAKE_PHOTO, EGT_STM_REQUEST);

    // Set flag 'system initialising' flag. In main loop where stm32 waits for
    // responses back from the ESP, if it gets a response saying a photo was taken
    // and the system init flag has been set then it knows that the photo was a test
    // photo as this flag is only set once on startup. The STM32 can then blink an
    // led to let the user know that the system has been initialised
    event_group_set_bit(&gbl_EventsStm, EVENT_STM_SYSTEM_INITIALISING, EGT_ACTIVE);

    // Enter main loop
    bpk_t BpkEspResponse, MapleBpacket;
    uint8_t lastRTCSecond = 0;

    while (1) {

        /* Turn the ESP on or off depending on if there are esp tasks that need to occur */

        // Check if there are any esp flags that are set that are not ESP_ON or ESP_READY
        if ((event_group_get_bits(&gbl_EventsEsp, EGT_ACTIVE) &
             ~((0x01 << EVENT_ESP_ON) | (0x01 << EVENT_ESP_READY))) != 0) {

            // There is an esp event that needs to occur. Ensure the ESP has been turned on
            if (event_group_poll_bit(&gbl_EventsEsp, EVENT_ESP_ON, EGT_ACTIVE) != TRUE) {
                wd_esp_turn_on();
            }
        } else {

            // Only turn the ESP off is the USB is not connected
            if (GPIO_PIN_IS_HIGH(USBC_CONN_PORT, USBC_CONN_PIN) == FALSE) {
                // There are no pending esp events. Turn the ESP off if it is not already off
                if (event_group_poll_bit(&gbl_EventsEsp, EVENT_ESP_ON, EGT_ACTIVE) == TRUE) {
                    wd_esp_turn_off();
                }
            }
        }

        /* Put the STM32 to sleep if required */
        if (event_group_poll_bit(&gbl_EventsStm, EVENT_STM_SLEEP, EGT_ACTIVE) == TRUE) {
            event_group_clear_bit(&gbl_EventsStm, EVENT_STM_SLEEP, EGT_ACTIVE);

            // TODO: Put the STM32 to sleep
        }

        /* Request ESP32 to take a photo if the 'take photo' flag has been set */
        if ((event_group_poll_bit(&gbl_EventsEsp, EVENT_ESP_TAKE_PHOTO, EGT_ACTIVE) == TRUE) &&
            (event_group_poll_bit(&gbl_EventsEsp, EVENT_ESP_TAKE_PHOTO, EGT_EVENT_RUNNING) == FALSE)) {

            // Don't request a photo until the ESP is in the ready state. The ESP takes
            // a second or two to startup after it has been turned on. The ESP_READY flag
            // will be set automatically by the STM when the ESP is ready to receive commands
            if (event_group_poll_bit(&gbl_EventsEsp, EVENT_ESP_READY, EGT_ACTIVE) == TRUE) {
                event_group_clear_bit(&gbl_EventsEsp, EVENT_ESP_TAKE_PHOTO, EGT_ACTIVE);

                uint8_t errorCode[1];
                if (wd_request_photo_capture(errorCode) != TRUE) {
                    wd_error_handler_2("Error %s on line %i. Code %i\r\n", __FILE__, __LINE__, errorCode[0]);
                }
            }
        }

        /* Check whether the RTC alarm needs to be updated. This flag is set in the ISR that is triggered
            whenever the alarm time in the RTC matches the RTC time */
        if (event_group_poll_bit(&gbl_EventsStm, EVENT_STM_RTC_UPDATE_ALARM, EGT_ACTIVE) == TRUE) {
            event_group_clear_bit(&gbl_EventsStm, EVENT_STM_RTC_UPDATE_ALARM, EGT_ACTIVE);

            /* Calculate the next alarm time */
            dt_datetime_t AlarmTime;
            if (rtc_read_alarm_datetime(&AlarmTime) != TRUE) {
                wd_error_handler(__FILE__, __LINE__);
            }

            dt_datetime_add_time(&AlarmTime, gbl_CaptureTime.intervalSecond, gbl_CaptureTime.intervalMinute,
                                 gbl_CaptureTime.intervalHour, gbl_CaptureTime.intervalDay);

            // Check if the system still needs to take photos
            if (dt1_greater_than_dt2(&AlarmTime, &gbl_CaptureTime.Start) == TRUE) {
                rtc_disable_alarm();
            } else {
                rtc_set_alarm(&AlarmTime);
            }
        }

        /* Process all packets received from the ESP32 */
        if (uart_read_bpacket(0, &BpkEspResponse) == TRUE) {
            wd_handle_esp_response(&BpkEspResponse);
        }

