gianbartadougall/WatchDog-ESP32/STM32/Core/Src/watchdog.c
        // TODO: Process the button being pressed

        // Polling the USBC connection pin. The reason it is being polled instead of having an
        // interrupt is because if the system is not powered by batteries and only powered by
        // a USB C connector, the pin will go high before the circuit starts running in which
        // case the interrupt would never fire. Polling ensures that no matter how the system
        // is powered, it will always know if the USBC is connected or not
        if (GPIO_PIN_IS_HIGH(USBC_CONN_PORT, USBC_CONN_PIN)) {
            GPIO_SET_HIGH(LED_GREEN_PORT, LED_GREEN_PIN);

            /* When the USB is connected, the ESP32 should turn on and be ready for any commands
                request by the computer */
            if (event_group_poll_bit(&gbl_EventsEsp, EVENT_ESP_ON, EGT_ACTIVE) == FALSE) {

                // Turn the ESP on. This will also set the EVENT_ESP_ON flag
                wd_esp_turn_on();

                /****** START CODE BLOCK ******/
                // Description: For the moment, the ESP is always on because the PCB for the ESP
                // doesn't work. Given this, we will send a ping request instead of turning the
                // esp on (as it is always on). The response from the ping request will be the
                // same as if the ESP has just turned on and the EVENT_ESP_ON and EVENT_ESP_READY
                // flags should be set
                bpk_t PingRequest;
                bpk_create(&PingRequest, BPK_Addr_Receive_Esp32, BPK_Addr_Send_Stm32, BPK_Request_Ping,
                           BPK_Code_Execute, 0, NULL);
                wd_write_bpacket_esp(&PingRequest);
                /****** END CODE BLOCK ******/
            }

            // USBC is connected, check for any incoming bpackets and process them if any come
            if (usb_read_packet(&MapleBpacket) == TRUE) {
                wd_handle_maple_request(&MapleBpacket);
            }

            /* Send the datetime to the computer to display on GUI */
            dt_datetime_t dt;
            if (rtc_read_datetime(&dt) != TRUE) {
                wd_error_handler(__FILE__, __LINE__);
            }

            if (lastRTCSecond != dt.Time.second) {
                lastRTCSecond = dt.Time.second;

                uint8_t datetimeData[7] = {
                    dt.Time.second, dt.Time.minute,    dt.Time.hour,        dt.Date.day,
                    dt.Date.month,  dt.Date.year >> 8, dt.Date.year & 0xFF,
                };

                bpk_t BpkDatetime;
                bpk_create(&BpkDatetime, BPK_Addr_Receive_Maple, BPK_Addr_Send_Stm32, BPK_Req_Get_Datetime,
                           BPK_Code_Success, 7, datetimeData);

                wd_write_bpacket_maple(&BpkDatetime);
            }

        } else {
            GPIO_SET_LOW(LED_GREEN_PORT, LED_GREEN_PIN);
        }

        // TODO: Check whether the STM32 needs to go to sleep
    }
}

void wd_handle_maple_request(bpk_t* Bpacket) {

    // Create a bpacket to store the response to send back to Maple
    static bpk_t BpkStmResponse;

    if (Bpacket->Request.val == BPK_REQ_COPY_FILE) {
        /****** START CODE BLOCK ******/
        // Description: Debugging. Can delete whenever
        bpk_t DebugMessage;
        bpk_create_sp(&DebugMessage, BPK_Addr_Receive_Maple, BPK_Addr_Send_Stm32, BPK_Request_Message, BPK_Code_Success,
                      "STM ack Maple req Copy file");
        wd_write_bpacket_maple(&DebugMessage);
        /****** END CODE BLOCK ******/

        // Forward message to ESP32
        bpk_create(&BpkStmResponse, BPK_Addr_Receive_Esp32, BPK_Addr_Send_Stm32, BPK_Req_Copy_File, BPK_Code_Execute,
                   Bpacket->Data.numBytes, Bpacket->Data.bytes);
        wd_write_bpacket_esp(&BpkStmResponse);

        return;
    }

    if (Bpacket->Request.val == BPK_REQ_DELETE_FILE) {
        /****** START CODE BLOCK ******/
        // Description: Debugging. Can delete whenever
        bpk_t DebugMessage;
        bpk_create_sp(&DebugMessage, BPK_Addr_Receive_Maple, BPK_Addr_Send_Stm32, BPK_Request_Message, BPK_Code_Success,
                      "STM ack Maple req delete file");
        wd_write_bpacket_maple(&DebugMessage);
        /****** END CODE BLOCK ******/

        // Forward message to ESP32
        bpk_create(&BpkStmResponse, BPK_Addr_Receive_Esp32, BPK_Addr_Send_Stm32, BPK_Req_Delete_File, BPK_Code_Execute,
                   Bpacket->Data.numBytes, Bpacket->Data.bytes);
        wd_write_bpacket_esp(&BpkStmResponse);

        return;
    }

    switch (Bpacket->Request.val) {

        case BPK_REQUEST_PING:;

            // Create response
            static uint8_t stmPingCode = 47;
            if (bpk_create(&BpkStmResponse, BPK_Addr_Receive_Maple, BPK_Addr_Send_Stm32, BPK_Request_Ping,
                           BPK_Code_Success, 1, &stmPingCode) != TRUE) {
                wd_error_handler(__FILE__, __LINE__);
                break;
            }

            // Send bpacket to Maple
            wd_write_bpacket_maple(&BpkStmResponse);

            break;

        case BPK_REQ_LIST_DIR:;

            /****** START CODE BLOCK ******/
            // Description: Debugging. Can delete whenever
            bpk_t DebugMessage;
            bpk_create_sp(&DebugMessage, BPK_Addr_Receive_Maple, BPK_Addr_Send_Stm32, BPK_Request_Message,
                          BPK_Code_Success, "STM ack Maple req list dir");
            wd_write_bpacket_maple(&DebugMessage);
            /****** END CODE BLOCK ******/

            bpk_create(&BpkStmResponse, BPK_Addr_Receive_Esp32, BPK_Addr_Send_Stm32, BPK_Req_List_Dir, BPK_Code_Execute,
                       0, NULL);
            wd_write_bpacket_esp(&BpkStmResponse);
            break;

        case BPK_REQ_TAKE_PHOTO:;

            /****** START CODE BLOCK ******/
            // Description: Testing this bit of code. Can delete if necessary
            uint8_t occured = FALSE;
            bpk_t debugMessage;
            if (event_group_poll_bit(&gbl_EventsEsp, EVENT_ESP_ON, EGT_ACTIVE) == FALSE) {
                bpk_create_sp(&debugMessage, BPK_Addr_Receive_Maple, BPK_Addr_Send_Stm32, BPK_Request_Message,
                              BPK_Code_Success, "Maple request but ESP is not on");
                wd_write_bpacket_maple(&debugMessage);
                occured = TRUE;
            }
            if (event_group_poll_bit(&gbl_EventsEsp, EVENT_ESP_READY, EGT_ACTIVE) == FALSE) {
                bpk_create_sp(&debugMessage, BPK_Addr_Receive_Maple, BPK_Addr_Send_Stm32, BPK_Request_Message,
                              BPK_Code_Success, "Maple request but ESP is not ready");
                wd_write_bpacket_maple(&debugMessage);
                occured = TRUE;
            }

            if (occured == TRUE) {
                return;
            }
            /****** END CODE BLOCK ******/

            /* Set the required event group bits */
            event_group_set_bit(&gbl_EventsEsp, EVENT_ESP_TAKE_PHOTO, EGT_ACTIVE);
            event_group_clear_bit(&gbl_EventsEsp, EVENT_ESP_TAKE_PHOTO, EGT_STM_REQUEST);
            event_group_clear_bit(&gbl_EventsEsp, EVENT_ESP_TAKE_PHOTO, EGT_EVENT_RUNNING);

            break;

