gianbartadougall/WatchDog-ESP32/STM32/Core/Src/watchdog.c
        /****** START CODE BLOCK ******/
        // Description: Debug messaging. Can delete when confident everything is working correctly
        log_usb_success("Took a photo\r\n!");
        for (int i = 0; i < Bpacket->Data.numBytes; i++) {
            log_usb_success("%c", Bpacket->Data.bytes[i]);
        }
        log_usb_message("\r\n");

        /****** END CODE BLOCK ******/

        return;
    }

    if (Bpacket->Request.val == BPK_REQ_LIST_DIR) {

        /****** START CODE BLOCK ******/
        // Description: Debugging. Can delete whenever
        bpk_t DebugMessage;
        bpk_create_sp(&DebugMessage, BPK_Addr_Receive_Maple, BPK_Addr_Send_Stm32, BPK_Request_Message, BPK_Code_Success,
                      "STM received dir list back");
        wd_write_bpacket_maple(&DebugMessage);
        /****** END CODE BLOCK ******/

        // Forward the bpacket to maple
        Bpacket->Receiver = BPK_Addr_Receive_Maple;
        wd_write_bpacket_maple(Bpacket);
        return;
    }
}

void wd_error_handler(char* fileName, uint16_t lineNumber) {

    // TODO: Turn the ESP off

    while (1) {

        HAL_Delay(1000);
        GPIO_TOGGLE(LED_RED_PORT, LED_RED_PIN);

        log_usb_error("Error code in %s on line %i\r\n", fileName, lineNumber);
    }
}

uint8_t wd_request_photo_capture(uint8_t errorCode[1]) {

    if (ds18b20_read_temperature(&Ds18b20) != TRUE) {
        errorCode[0] = bpkErrRecordTemp[0];
        return FALSE;
    }

    dt_datetime_t Datetime;
    if (rtc_read_datetime(&Datetime) != TRUE) {
        errorCode[0] = bpkErrReadDatetime[0];
        return FALSE;
    }

    /* Store temperature and datetime into bpacket and send request to the ESP */
    uint8_t data[sizeof(dt_datetime_t) + sizeof(float)];
    wd_utils_photo_data_to_array(data, &Datetime, &lg_CameraSettings, Ds18b20.temp);

    bpk_t BpkTakePhoto;
    bpk_create(&BpkTakePhoto, BPK_Addr_Receive_Esp32, BPK_Addr_Send_Stm32, BPK_Req_Take_Photo, BPK_Code_Execute,
               sizeof(dt_datetime_t) + sizeof(float), data);
    wd_write_bpacket_esp(&BpkTakePhoto);

    // Set the appropriate event bits
    event_group_set_bit(&gbl_EventsEsp, EVENT_ESP_TAKE_PHOTO, EGT_EVENT_RUNNING);

    // Start timeout
    et_set_timeout(&lg_Timeouts, EVENT_ESP_TAKE_PHOTO, 6000);

    /****** START CODE BLOCK ******/
    // Description: Debugging. Can remove when not needed
    bpk_t debugMessage;
    if (event_group_poll_bit(&gbl_EventsEsp, EVENT_ESP_TAKE_PHOTO, EGT_STM_REQUEST) == TRUE) {
        bpk_create_sp(&debugMessage, BPK_Addr_Receive_Maple, BPK_Addr_Send_Stm32, BPK_Request_Message, BPK_Code_Success,
                      "STM32 Requesting photo");
    } else {
        bpk_create_sp(&debugMessage, BPK_Addr_Receive_Maple, BPK_Addr_Send_Stm32, BPK_Request_Message, BPK_Code_Success,
                      "Maple Requesting photo");
    }
    wd_write_bpacket_maple(&debugMessage);
    /****** END CODE BLOCK ******/

    return TRUE;
}

uint8_t wd_write_settings(capture_time_t* CaptureTime, camera_settings_t* CameraSettings) {

    uint32_t* startAddress = (uint32_t*)WD_FLASH_SETTINGS_START_ADDRESS;

    // Loop through each address and look for the first 2 32 bit address that have no data
    // in them
    while ((*startAddress != 0xFFFFFFFF) || ((*(startAddress + 1)) != 0xFFFFFFFF)) {
        // Increment by 2 because flash is comprised of 64 bit values
        startAddress += 2;
    }

    // Compact capture time data into a uin64_t array. This is required because only 64 bit
    // data can be written to the flash
    uint64_t settingsData[4] = {
        (((uint64_t)CaptureTime->Start.Time.second) << 56) | (((uint64_t)CaptureTime->Start.Time.minute) << 48) |
            (((uint64_t)CaptureTime->Start.Time.hour) << 40) | (((uint64_t)CaptureTime->Start.Date.day) << 32) |
            (((uint64_t)CaptureTime->Start.Date.month) << 24) | (((uint64_t)CaptureTime->Start.Date.year) << 8),
        (((uint64_t)CaptureTime->End.Time.second) << 56) | (((uint64_t)CaptureTime->End.Time.minute) << 48) |
            (((uint64_t)CaptureTime->End.Time.hour) << 40) | (((uint64_t)CaptureTime->End.Date.day) << 32) |
            (((uint64_t)CaptureTime->End.Date.month) << 24) | (((uint64_t)CaptureTime->End.Date.year) << 8),
        (((uint64_t)CaptureTime->intervalSecond) << 48) | (((uint64_t)CaptureTime->intervalMinute) << 32) |
            (((uint64_t)CaptureTime->intervalHour) << 16) | (((uint64_t)CaptureTime->intervalSecond) << 0),
        ((uint64_t)0xFFFFFFFF << 32) | (((uint64_t)CameraSettings->frameSize) << 24) |
            (((uint64_t)CameraSettings->jpegCompression) << 16) | 0x0000FFFF,
    };

    // Check whether data has already been written to the page or not
    if (startAddress >= (uint32_t*)(WD_FLASH_SETTINGS_START_ADDRESS + (8 * 4))) {
        // Assume that the data needs to be written
        uint8_t writeRequired = FALSE;

        // Compare the data to write with the last bit of data that was written and see if they
        // are the same
        for (uint8_t i = 0; i < 4; i++) {

            uint64_t upperBytes = (uint64_t) * (startAddress - (8 - (i * 2))) << 32;
            uint32_t lowerBytes = (uint64_t) * (startAddress - (7 - (i * 2)));

            if (settingsData[i] != (upperBytes | lowerBytes)) {
                writeRequired = TRUE;
                break;
            }
        }

        if (writeRequired == FALSE) {
            return TRUE;
        }

        // Check whether the 32 bit address is at an odd or even address. If the
        // address is currently odd then we need to increment one to make it even
        // that way a full 64 bit value can be written to it otherwise writing to
        // the flash will fail when doing so with an odd address
        if (((((uint32_t)startAddress) / 4) % 2) != 0) {
            startAddress++;
        }

        // Calculate the correct address for the new data
        if ((startAddress + 8) > (uint32_t*)WD_FLASH_SETTINGS_END_ADDRESS) {

            startAddress = (uint32_t*)WD_FLASH_SETTINGS_START_ADDRESS;

            /* Erase the page to start again */
            if (HAL_FLASH_Unlock() != HAL_OK) {
                wd_error_handler(__FILE__, __LINE__);
            }

            FLASH_EraseInitTypeDef eraseConfig;
            eraseConfig.TypeErase = FLASH_TYPEERASE_PAGES;
            eraseConfig.Page      = 127;
            eraseConfig.NbPages   = 1; // Number of pages to be erased

            uint32_t pageError = 0;
            if (HAL_FLASHEx_Erase(&eraseConfig, &pageError) != HAL_OK) {
                wd_error_handler(__FILE__, __LINE__);
            }

            if (HAL_FLASH_Lock() != HAL_OK) {
                wd_error_handler(__FILE__, __LINE__);
            }
        }
    }

    /* Write data to memory */
    if (HAL_FLASH_Unlock() != HAL_OK) {
        wd_error_handler(__FILE__, __LINE__);
    }

